Tekla Open API Reference for Tekla Structures 2025
Parallel.PlaneToPlane Method (GeometricPlane, GeometricPlane)
 Returns true if the given planes are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool PlaneToPlane(
	GeometricPlane Plane1,
	GeometricPlane Plane2
)
Public Shared Function PlaneToPlane (
	Plane1 As GeometricPlane,
	Plane2 As GeometricPlane
) As Boolean
Parameters
Plane1
Type: Tekla.Structures.Geometry3d.GeometricPlane
The first plane to be used.
Plane2
Type: Tekla.Structures.Geometry3d.GeometricPlane
The second plane to be used.
Return Value
Type: Boolean
True if the given planes are parallel.
See Also
Reference
Parallel Class
PlaneToPlane Overload
Tekla.Structures.Geometry3d Namespace